old_site/openFoam/cases/heavingCylinder/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      dynamicMotionSolverFvMesh;

//motionSolverLibs ("libfvMotionSolver.so");
twoDMotion      yes;
solver            displacementLaplacian;
//diffusivity       quadratic inverseDistance 1(floatingObject);
diffusivity inverseDistance (floatingObject);




// ************************************************************************* //
